content/man/man1/flatpak-document-unexport.1.org
#+TITLE: Manpages - flatpak-document-unexport.1
* NAME
flatpak-document-unexport - Stop exporting a file

* SYNOPSIS
*flatpak document-unexport* [OPTION...] FILE

* DESCRIPTION
Removes the document id for the file from the document portal. This will
make the document unavailable to all sandboxed applications.

* OPTIONS
The following options are understood:

*--doc-id*

#+begin_quote
Interpret FILE as a document ID rather than a file path. This is useful
for example when the file has been deleted.

#+end_quote

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

* SEE ALSO
*flatpak*(1), *flatpak-document-export*(1), *flatpak-document-info*(1),
*flatpak-documents*(1)
